flowPastCircularCylinderRe1000/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    hole
    {
        type            nutkWallFunction;//zeroGradient;
        value           $internalField;
    }

    inlet
    {
        type            calculated;
        value           $internalField;
    }

    "(outlet|top|bottom|down|walls)"
    {
        type            calculated;
        value           $internalField;
    }

    "(frontAndBack|defaultFaces)"
    {
        type            empty;
    }
}


// ************************************************************************* //
